Repository: JoDi-2903/HerbSnap
Catalog: *.lproj/Localizable.strings
Languages: de

source: Back
de: Zurück

source: Allium ursinum
de: Bärlauch

source: Basil
de: Basilikum

source: Chives
de: Schnittlauch

source: Garden cress
de: Gartenkresse

source: Laurus nobilis
de: Lorbeer

source: Lovage
de: Liebstöckel

source: Marjoram
de: Majoran

source: Mentha
de: Minzen

source: Parsley
de: Petersilie

source: Rosemary
de: Rosmarin

source: Salvia
de: Salbei

source: Sweet woodruff
de: Waldmeister

source: Thymus
de: Thymiane

source: Tropaeolum
de: Kapuzinerkressen

source: HerbSnap is an app for classifying herbs based on photos of the plant. As input data, a photo can either be taken directly via the app or an existing image from the gallery can be opened. The app processes the data on the device and uses artificial intelligence to determine the herb species. Two different prediction models are available, which can be switched between using the button in the upper right corner. One model was generated with CreateML from Apple and the other with TensorFlow from Google. As result, the detected herb species is output, with a direct link to the Wikipedia page for more information. If the prediction of the model is not completely clear, the two most probable prediction classes are output.
de: HerbSnap ist eine App zur Klassifikation von Kräuter anhand von Fotos der Pflanze. Als Eingabedaten kann wahlweise direkt eine Foto über die App aufgenommen oder ein vorhandenes Bild aus der Galerie geöffnet werden. Die App verarbeitet die Daten auf dem Gerät und setzt Künstliche Intelligenz für die Bestimmung der Kräuter-Art ein. Hierbei stehen zwei verschiedene Vorhersagemodelle bereit, zwischen denen mit dem Button oben rechts gewechselt werden kann. Ein Modell wurde mit CreateML von Apple generiert und das andere mit TensorFlow von Google. Als Ergebnis wird die erkannte Kräuter-Art, mit einem direkten Link zur Wikipedia-Seite für weitere Informationen, ausgegeben. Sollte die Vorhersage des Modells nicht ganz eindeutig sein, werden die zwei wahrscheinlichsten Vorhersageklassen ausgegeben.

source: Photo tips
de: Foto-Tipps

source: too close
de: zu nah

source: too far
de: zu fern

source: several types
de: mehrere Arten

source: This app was created as part of the student research thesis at DHBW Stuttgart.
de: Diese App entstand als Teil der Studienarbeit an der DHBW Stuttgart.

source: Legal notice
de: Rechtlicher Hinweis

source: Copyright by Jonathan Diebel
de: Copyright: Jonathan Diebel
